## Pandas Series

In [1]:
import pandas as pd
import numpy as np

In [2]:
labels = ['a', 'b', 'c', 'd']
myList = [1, 2, 3, 4]

myArr = np.array(myList)
myDict = {'a':10, 'b':20, 'c':30, 'd':40}

In [3]:
ser1 = pd.Series(data = myList)
ser1

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
ser2 = pd.Series(data = myList, index = labels)
ser2

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
ser3 = pd.Series(data = myDict)
ser3

a    10
b    20
c    30
d    40
dtype: int64

In [6]:
pd.Series(data = ['a', 'b', 'c', 'd'])

0    a
1    b
2    c
3    d
dtype: object

In [7]:
ser3[0]

10

In [8]:
ser3['a']

10

## Pandas DataFrame

In [9]:
pd.DataFrame(data = np.random.randn(5,4))

          0         1         2         3
0 -0.356844 -0.181042  0.791414  1.443697
1  0.079924  1.719692 -0.472651 -0.028982
2  0.591392 -0.070113  0.196736 -1.381005
3  0.371948 -0.124048  1.688695  1.472286
4 -0.334269 -0.864226 -0.673083  0.434475

In [10]:
pd.DataFrame(data = np.random.randn(5,4), index=['a', 'b', 'c', 'd','e'])

          0         1         2         3
a -0.202519 -1.489142 -0.936459 -0.078873
b  0.184457  1.606724  0.596452  0.203234
c -0.146579 -0.544827  0.589748  1.371431
d -0.318901 -0.907202 -0.147819  0.759086
e  0.590713  1.525635  0.520193  0.419362

In [11]:
df = pd.DataFrame(data = np.random.randn(5,4), index=['a', 'b', 'c', 'd','e'], 
            columns = ['w', 'x', 'y', 'z'])
df

          w         x         y         z
a  0.555374  0.980786 -0.652982 -1.021267
b -1.967431  1.410860  1.992209 -0.269642
c  1.561575 -0.852075 -1.587499 -1.830047
d -0.858882 -2.001424  0.681573  0.105437
e  0.215147  1.079292 -0.498117  0.050988

In [12]:
df['w']

a    0.555374
b   -1.967431
c    1.561575
d   -0.858882
e    0.215147
Name: w, dtype: float64

In [13]:
df[['w','z']]

          w         z
a  0.555374 -1.021267
b -1.967431 -0.269642
c  1.561575 -1.830047
d -0.858882  0.105437
e  0.215147  0.050988

In [14]:
df['new_column'] = df['w'] + df['z']

In [15]:
df

          w         x         y         z  new_column
a  0.555374  0.980786 -0.652982 -1.021267   -0.465893
b -1.967431  1.410860  1.992209 -0.269642   -2.237073
c  1.561575 -0.852075 -1.587499 -1.830047   -0.268472
d -0.858882 -2.001424  0.681573  0.105437   -0.753445
e  0.215147  1.079292 -0.498117  0.050988    0.266135

In [16]:
df['new_column'] = [1, 2, 3, 4, 5]
df

          w         x         y         z  new_column
a  0.555374  0.980786 -0.652982 -1.021267           1
b -1.967431  1.410860  1.992209 -0.269642           2
c  1.561575 -0.852075 -1.587499 -1.830047           3
d -0.858882 -2.001424  0.681573  0.105437           4
e  0.215147  1.079292 -0.498117  0.050988           5

In [17]:
df.shape

(5, 5)

In [18]:
df.drop('new_column', axis = 1)

          w         x         y         z
a  0.555374  0.980786 -0.652982 -1.021267
b -1.967431  1.410860  1.992209 -0.269642
c  1.561575 -0.852075 -1.587499 -1.830047
d -0.858882 -2.001424  0.681573  0.105437
e  0.215147  1.079292 -0.498117  0.050988

In [19]:
df

          w         x         y         z  new_column
a  0.555374  0.980786 -0.652982 -1.021267           1
b -1.967431  1.410860  1.992209 -0.269642           2
c  1.561575 -0.852075 -1.587499 -1.830047           3
d -0.858882 -2.001424  0.681573  0.105437           4
e  0.215147  1.079292 -0.498117  0.050988           5

In [20]:
df.drop('new_column', axis = 1, inplace = True)

In [21]:
df

          w         x         y         z
a  0.555374  0.980786 -0.652982 -1.021267
b -1.967431  1.410860  1.992209 -0.269642
c  1.561575 -0.852075 -1.587499 -1.830047
d -0.858882 -2.001424  0.681573  0.105437
e  0.215147  1.079292 -0.498117  0.050988

In [22]:
df.loc['a']

w    0.555374
x    0.980786
y   -0.652982
z   -1.021267
Name: a, dtype: float64

In [23]:
df.iloc[0]

w    0.555374
x    0.980786
y   -0.652982
z   -1.021267
Name: a, dtype: float64

In [24]:
df.loc[['a', 'b'], ['w', 'z']]

          w         z
a  0.555374 -1.021267
b -1.967431 -0.269642

In [25]:
df['w'] > 0

a     True
b    False
c     True
d    False
e     True
Name: w, dtype: bool

In [26]:
df[df['w'] > 0]

          w         x         y         z
a  0.555374  0.980786 -0.652982 -1.021267
c  1.561575 -0.852075 -1.587499 -1.830047
e  0.215147  1.079292 -0.498117  0.050988

In [27]:
df[df['w'] > 0]['x']

a    0.980786
c   -0.852075
e    1.079292
Name: x, dtype: float64

In [28]:
df['new'] = ['A', 'B', 'C', 'D', 'E']

In [29]:
df

          w         x         y         z new
a  0.555374  0.980786 -0.652982 -1.021267   A
b -1.967431  1.410860  1.992209 -0.269642   B
c  1.561575 -0.852075 -1.587499 -1.830047   C
d -0.858882 -2.001424  0.681573  0.105437   D
e  0.215147  1.079292 -0.498117  0.050988   E

In [30]:
df.set_index('new', inplace = True)

In [31]:
df

            w         x         y         z
new
A    0.555374  0.980786 -0.652982 -1.021267
B   -1.967431  1.410860  1.992209 -0.269642
C    1.561575 -0.852075 -1.587499 -1.830047
D   -0.858882 -2.001424  0.681573  0.105437
E    0.215147  1.079292 -0.498117  0.050988

## Missing Values

In [32]:
newDF = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]}
newDF = pd.DataFrame(newDF)
newDF

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [88]:
newDF.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [33]:
newDF.dropna()

     A    B  C
0  1.0  5.0  1

In [34]:
newDF.dropna(axis = 1)

   C
0  1
1  2
2  3

In [35]:
newDF.fillna('FILL')

      A     B  C
0     1     5  1
1     2  FILL  2
2  FILL  FILL  3

In [36]:
newDF['A'].fillna(value = newDF['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [37]:
df = pd.read_csv('Salaries.csv')

In [38]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

## Group By

In [39]:
data = {'Company':['GOOGLE', 'GOOGLE', 'MICROSOFT', 'MICROSOFT', 'FACEBOOK', 
                   'FACEBOOK'], 'Person':['P1', 'P2', 'P3', 'P4', 'P5', 'P6'],
        'Sales':[4500, 5500, 1000, 3400, 1000, 5000]}

df = pd.DataFrame(data)
df

     Company Person  Sales
0     GOOGLE     P1   4500
1     GOOGLE     P2   5500
2  MICROSOFT     P3   1000
3  MICROSOFT     P4   3400
4   FACEBOOK     P5   1000
5   FACEBOOK     P6   5000

In [40]:
df.sum()

Company    GOOGLEGOOGLEMICROSOFTMICROSOFTFACEBOOKFACEBOOK
Person                                       P1P2P3P4P5P6
Sales                                               20400
dtype: object

In [41]:
df['Sales'].sum()

20400

In [43]:
df.groupby('Company').sum()

           Sales
Company
FACEBOOK    6000
GOOGLE     10000
MICROSOFT   4400

In [44]:
df.groupby('Company').min()

          Person  Sales
Company
FACEBOOK      P5   1000
GOOGLE        P1   4500
MICROSOFT     P3   1000

In [45]:
df.groupby('Company').mean()

           Sales
Company
FACEBOOK    3000
GOOGLE      5000
MICROSOFT   2200

In [47]:
df.describe()

             Sales
count     6.000000
mean   3400.000000
std    1984.943324
min    1000.000000
25%    1600.000000
50%    3950.000000
75%    4875.000000
max    5500.000000

In [48]:
df.groupby('Company').describe()

          Sales
          count    mean          std     min     25%     50%     75%     max
Company
FACEBOOK    2.0  3000.0  2828.427125  1000.0  2000.0  3000.0  4000.0  5000.0
GOOGLE      2.0  5000.0   707.106781  4500.0  4750.0  5000.0  5250.0  5500.0
MICROSOFT   2.0  2200.0  1697.056275  1000.0  1600.0  2200.0  2800.0  3400.0

In [58]:
pd.concat([df, pd.DataFrame({'Company':'AMAZON', 'Person':'P7', 'Sales':6000}, 
                            index=[6])])

     Company Person  Sales
0     GOOGLE     P1   4500
1     GOOGLE     P2   5500
2  MICROSOFT     P3   1000
3  MICROSOFT     P4   3400
4   FACEBOOK     P5   1000
5   FACEBOOK     P6   5000
6     AMAZON     P7   6000

In [67]:
df = pd.concat([df, pd.DataFrame([1, 2, 3, 4, 5, 6], columns=['Number'])], axis = 1)
df

     Company Person  Sales  Number
0     GOOGLE     P1   4500       1
1     GOOGLE     P2   5500       2
2  MICROSOFT     P3   1000       3
3  MICROSOFT     P4   3400       4
4   FACEBOOK     P5   1000       5
5   FACEBOOK     P6   5000       6

## Miscellaneous

In [68]:
df['Company'].unique()

array(['GOOGLE', 'MICROSOFT', 'FACEBOOK'], dtype=object)

In [69]:
df['Company'].nunique()

3

In [70]:
df.groupby('Company').count()

           Person  Sales  Number
Company
FACEBOOK        2      2       2
GOOGLE          2      2       2
MICROSOFT       2      2       2

In [71]:
df['Company'].value_counts()

GOOGLE       2
MICROSOFT    2
FACEBOOK     2
Name: Company, dtype: int64

In [87]:
#df[(df['Sales'] % 1000 == 0 & df['Sales'] > 3000)]

In [79]:
def times2(value):
    return value * 2

In [80]:
df['Number'].apply(times2)

0     2
1     4
2     6
3     8
4    10
5    12
Name: Number, dtype: int64

In [81]:
df['Number'].apply(lambda x : x*2)

0     2
1     4
2     6
3     8
4    10
5    12
Name: Number, dtype: int64

In [84]:
df['Company'].apply(len)

0    6
1    6
2    9
3    9
4    8
5    8
Name: Company, dtype: int64

In [85]:
df.apply(len)

Company    6
Person     6
Sales      6
Number     6
dtype: int64

In [90]:
df.sort_values('Sales', ascending = False)

     Company Person  Sales  Number
1     GOOGLE     P2   5500       2
5   FACEBOOK     P6   5000       6
0     GOOGLE     P1   4500       1
3  MICROSOFT     P4   3400       4
2  MICROSOFT     P3   1000       3
4   FACEBOOK     P5   1000       5

In [91]:
df.drop('Number', axis=1, inplace=True)

In [92]:
df

     Company Person  Sales
0     GOOGLE     P1   4500
1     GOOGLE     P2   5500
2  MICROSOFT     P3   1000
3  MICROSOFT     P4   3400
4   FACEBOOK     P5   1000
5   FACEBOOK     P6   5000

In [93]:
df.drop(5)

     Company Person  Sales
0     GOOGLE     P1   4500
1     GOOGLE     P2   5500
2  MICROSOFT     P3   1000
3  MICROSOFT     P4   3400
4   FACEBOOK     P5   1000

In [94]:
df.columns

Index(['Company', 'Person', 'Sales'], dtype='object')

In [95]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [ ]:
#to_csv
#read_excel